Revit 2027 API
NumberingSchema.ScopeDefiningFilter Property
 The id of the filter that determines the scope for this schema.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ScopeDefiningFilter { get; set; }
Public Property ScopeDefiningFilter As ElementId
	Get
	Set
public:
property ElementId^ ScopeDefiningFilter {
	ElementId^ get ();
	void set (ElementId^ value);
}
member ScopeDefiningFilter : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace